function LP = fm_linkparam()

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%% 各リンクパラメータの定義 %%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%% リンクの連結関係を定義する %%%%%
% LPは各リンクの初期条件を記述している
% LPをデータで渡すときに様々なデータを渡せるように、構造体にしている

% BB(i) = 根元側で結合しているリンク番号

LP.BB = [0 1 2 3 4 5]; % 親リンクの番号
LP.J_type = [ 'R' 'R' 'R' 'R' 'R' 'R' ];

LP = make_lp_from_bb(LP);


%%%%% ベース部 (リンク0) の質量 %%%%%
LP.m0 = 500;

%%%%% ベース部 (リンク0) の慣性モーメント %%%%%
LP.inertia0 = [300 0 0;
    0 300 0;
    0 0 300];   % 0の部分がカップリング項(慣性乗積？)


LP.m = [ 5 50 50 10 5 5 ]; % リンク質量

%%%%% リンク系全体の質量 %%%%%
LP.mass = sum(LP.m) + LP.m0;

LP.Qi = [
    0 -pi/2 -pi/2 -pi/2 0 0;
    0 0 0 0 pi/2 0;
    0 0 0 0 0 0 ]; % 関節とリンク間のRPY

Iln = zeros(3, 3, 6);
Iln(:, :, 1) = [
    0.0292 0 0;
    0 0.0292 0;
    0 0 0.00625
    ];
Iln(:, :, 2) = [
    26.1 0 0;
    0 26.1 0;
    0 0 0.0625
    ];
Iln(:, :, 3) = [
    26.1 0 0;
    0 26.1 0;
    0 0 0.0625
    ];
Iln(:, :, 4) = [
    0.215 0 0;
    0 0.215 0;
    0 0 0.0125
    ];
Iln(:, :, 5) = [
    0.0292 0 0;
    0 0.0292 0;
    0 0 0.625
    ];
Iln(:, :, 6) = [
    0.0292 0 0;
    0 0.0292 0;
    0 0 0.625
    ];

LP.inertia = [
    1 0   0   1   0 0   1   0 0  1 0   0   1   0 0   1   0 0;
    0 1   0   0 0.1 0   0 0.1 0  0 1   0   0 0.1 0   0 0.1 0;
    0 0 0.1   0   0 1   0   0 1  0 0 0.1   0   0 1   0   0 1
    ]; % リンクの慣性テンソル

% 6つの3x3行列を横に並べて3x18行列を作成
LP.inertia = reshape(Iln, 3, 18);
LP.inertia


% 末端リンクから端点までの位置ベクトル  末端リンクの重心から手先への位置ベクトル
% 末端部を持たないリンクは0を入れる
LP.ce = zeros(3, LP.num_q);
% 末端リンクから端点までのRPY
LP.Qe = zeros(3, LP.num_q);

LP.c0 = [ 0 0 0  0 0 0;
    0 0 0 0 0 0;
    3.5/2 0 0  0 0 0 ]; % 衛星本体から見たリンクの座標(縦ベクトルxn個)

LP.cc = zeros(3,LP.num_q,LP.num_q); % リンク重心と関節の位置関係
% cc(i,i) リンクiの根本に向かう位置ベクトル cc(i,j) リンクiからjに向かう位置ベクトル
LP.cc(:,1,1) = [ 0 0  -0.25/2]';
LP.cc(:,2,2) = [ 0 0 -2.5/2 ]';
LP.cc(:,3,3) = [ 0 0 -2.5/2 ]';
LP.cc(:,4,4) = [ 0 0 -0.5/2 ]';
LP.cc(:,5,5) = [ 0 0 -0.25/2 ]';
LP.cc(:,6,6) = [ 0 0 -0.25/2 ]';
LP.cc(:,1,2) = [ 0 0 0.25/2 ]';
LP.cc(:,2,3) = [ 0 0 2.5/2 ]';
LP.cc(:,3,4) = [ 0 0 2.5/2 ]';
LP.cc(:,4,5) = [ 0 0 0.5/2 ]';
LP.cc(:,5,6) = [ 0 0 0.25/2 ]';

return